espressif/esp-idf/components/soc/esp32s31/register/soc/spi1_mem_s_reg.h
/** SPI1_MEM_S_RD_STATUS_REG register
 *  SPI1 status register.
 */
#define SPI1_MEM_S_RD_STATUS_REG (DR_REG_PSRAM_MSPI1_BASE + 0x2c)
/** SPI1_MEM_S_STATUS : R/W/SS; bitpos: [15:0]; default: 0;
 *  The value is stored when set SPI1_MEM_S_flash_rdsr bit and SPI1_MEM_S_flash_res bit.
 */
#define SPI1_MEM_S_STATUS    0x0000FFFFU
#define SPI1_MEM_S_STATUS_M  (SPI1_MEM_S_STATUS_V << SPI1_MEM_S_STATUS_S)
#define SPI1_MEM_S_STATUS_V  0x0000FFFFU
#define SPI1_MEM_S_STATUS_S  0
/** SPI1_MEM_S_WB_MODE : R/W; bitpos: [23:16]; default: 0;
 *  Mode bits in the flash fast read mode  it is combined with SPI1_MEM_S_fastrd_mode bit.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI1_MEM_S_WB_MODE    0x000000FFU
#define SPI1_MEM_S_WB_MODE_M  (SPI1_MEM_S_WB_MODE_V << SPI1_MEM_S_WB_MODE_S)
#define SPI1_MEM_S_WB_MODE_V  0x000000FFU
#define SPI1_MEM_S_WB_MODE_S  16
/** SPI1_MEM_S_WB_MODE_BITLEN : R/W; bitpos: [26:24]; default: 0;
 *  Mode bits length for flash fast read mode.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI1_MEM_S_WB_MODE_BITLEN    0x00000007U
#define SPI1_MEM_S_WB_MODE_BITLEN_M  (SPI1_MEM_S_WB_MODE_BITLEN_V << SPI1_MEM_S_WB_MODE_BITLEN_S)
#define SPI1_MEM_S_WB_MODE_BITLEN_V  0x00000007U
#define SPI1_MEM_S_WB_MODE_BITLEN_S  24
/** SPI1_MEM_S_WB_MODE_EN : R/W; bitpos: [27]; default: 0;
 *  Mode bits is valid while this bit is enable. 1: enable 0: disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI1_MEM_S_WB_MODE_EN    (BIT(27))
#define SPI1_MEM_S_WB_MODE_EN_M  (SPI1_MEM_S_WB_MODE_EN_V << SPI1_MEM_S_WB_MODE_EN_S)
#define SPI1_MEM_S_WB_MODE_EN_V  0x00000001U
#define SPI1_MEM_S_WB_MODE_EN_S  27

/** SPI1_MEM_S_MISC_REG register
 *  SPI1 misc register
 */
#define SPI1_MEM_S_MISC_REG (DR_REG_PSRAM_MSPI1_BASE + 0x34)
/** SPI1_MEM_S_CS0_DIS : R/W; bitpos: [0]; default: 0;
 *  SPI_CS0 pin enable, 1: disable SPI_CS0, 0: SPI_CS0 pin is active to select SPI
 *  device, such as flash, external RAM and so on.
 */
#define SPI1_MEM_S_CS0_DIS    (BIT(0))
#define SPI1_MEM_S_CS0_DIS_M  (SPI1_MEM_S_CS0_DIS_V << SPI1_MEM_S_CS0_DIS_S)
#define SPI1_MEM_S_CS0_DIS_V  0x00000001U
#define SPI1_MEM_S_CS0_DIS_S  0
/** SPI1_MEM_S_CS1_DIS : R/W; bitpos: [1]; default: 1;
 *  SPI_CS1 pin enable, 1: disable SPI_CS1, 0: SPI_CS1 pin is active to select SPI
 *  device, such as flash, external RAM and so on.
 */
#define SPI1_MEM_S_CS1_DIS    (BIT(1))
#define SPI1_MEM_S_CS1_DIS_M  (SPI1_MEM_S_CS1_DIS_V << SPI1_MEM_S_CS1_DIS_S)
#define SPI1_MEM_S_CS1_DIS_V  0x00000001U
#define SPI1_MEM_S_CS1_DIS_S  1
/** SPI1_MEM_S_CK_IDLE_EDGE : R/W; bitpos: [9]; default: 0;
 *  1: spi clk line is high when idle     0: spi clk line is low when idle
 */
#define SPI1_MEM_S_CK_IDLE_EDGE    (BIT(9))
#define SPI1_MEM_S_CK_IDLE_EDGE_M  (SPI1_MEM_S_CK_IDLE_EDGE_V << SPI1_MEM_S_CK_IDLE_EDGE_S)
#define SPI1_MEM_S_CK_IDLE_EDGE_V  0x00000001U
#define SPI1_MEM_S_CK_IDLE_EDGE_S  9
/** SPI1_MEM_S_CS_KEEP_ACTIVE : R/W; bitpos: [10]; default: 0;
 *  spi cs line keep low when the bit is set.
 */
#define SPI1_MEM_S_CS_KEEP_ACTIVE    (BIT(10))
#define SPI1_MEM_S_CS_KEEP_ACTIVE_M  (SPI1_MEM_S_CS_KEEP_ACTIVE_V << SPI1_MEM_S_CS_KEEP_ACTIVE_S)
#define SPI1_MEM_S_CS_KEEP_ACTIVE_V  0x00000001U
#define SPI1_MEM_S_CS_KEEP_ACTIVE_S  10

/** SPI1_MEM_S_TX_CRC_REG register
 *  SPI1 TX CRC data register.
 */
#define SPI1_MEM_S_TX_CRC_REG (DR_REG_PSRAM_MSPI1_BASE + 0x38)
/** SPI1_MEM_S_TX_CRC_DATA : RO; bitpos: [31:0]; default: 4294967295;
 *  For SPI1, the value of crc32.
 */
#define SPI1_MEM_S_TX_CRC_DATA    0xFFFFFFFFU
#define SPI1_MEM_S_TX_CRC_DATA_M  (SPI1_MEM_S_TX_CRC_DATA_V << SPI1_MEM_S_TX_CRC_DATA_S)
#define SPI1_MEM_S_TX_CRC_DATA_V  0xFFFFFFFFU
#define SPI1_MEM_S_TX_CRC_DATA_S  0

/** SPI1_MEM_S_CACHE_FCTRL_REG register
 *  SPI1 bit mode control register.
 *  This register is only for internal debugging purposes. Do not use it in
 *  applications.
 */
#define SPI1_MEM_S_CACHE_FCTRL_REG (DR_REG_PSRAM_MSPI1_BASE + 0x3c)
/** SPI1_MEM_S_CACHE_USR_ADDR_4BYTE : R/W; bitpos: [1]; default: 0;
 *  For SPI1,  cache  read flash with 4 bytes address, 1: enable, 0:disable.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI1_MEM_S_CACHE_USR_ADDR_4BYTE    (BIT(1))
#define SPI1_MEM_S_CACHE_USR_ADDR_4BYTE_M  (SPI1_MEM_S_CACHE_USR_ADDR_4BYTE_V << SPI1_MEM_S_CACHE_USR_ADDR_4BYTE_S)
#define SPI1_MEM_S_CACHE_USR_ADDR_4BYTE_V  0x00000001U
#define SPI1_MEM_S_CACHE_USR_ADDR_4BYTE_S  1
/** SPI1_MEM_S_FDIN_DUAL : R/W; bitpos: [3]; default: 0;
 *  For SPI1, din phase apply 2 signals. 1: enable 0: disable. The bit is the same with
 *  SPI1_MEM_S_fread_dio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI1_MEM_S_FDIN_DUAL    (BIT(3))
#define SPI1_MEM_S_FDIN_DUAL_M  (SPI1_MEM_S_FDIN_DUAL_V << SPI1_MEM_S_FDIN_DUAL_S)
#define SPI1_MEM_S_FDIN_DUAL_V  0x00000001U
#define SPI1_MEM_S_FDIN_DUAL_S  3
/** SPI1_MEM_S_FDOUT_DUAL : R/W; bitpos: [4]; default: 0;
 *  For SPI1, dout phase apply 2 signals. 1: enable 0: disable. The bit is the same
 *  with SPI1_MEM_S_fread_dio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI1_MEM_S_FDOUT_DUAL    (BIT(4))
#define SPI1_MEM_S_FDOUT_DUAL_M  (SPI1_MEM_S_FDOUT_DUAL_V << SPI1_MEM_S_FDOUT_DUAL_S)
#define SPI1_MEM_S_FDOUT_DUAL_V  0x00000001U
#define SPI1_MEM_S_FDOUT_DUAL_S  4
/** SPI1_MEM_S_FADDR_DUAL : R/W; bitpos: [5]; default: 0;
 *  For SPI1, address phase apply 2 signals. 1: enable 0: disable.  The bit is the same
 *  with SPI1_MEM_S_fread_dio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI1_MEM_S_FADDR_DUAL    (BIT(5))
#define SPI1_MEM_S_FADDR_DUAL_M  (SPI1_MEM_S_FADDR_DUAL_V << SPI1_MEM_S_FADDR_DUAL_S)
#define SPI1_MEM_S_FADDR_DUAL_V  0x00000001U
#define SPI1_MEM_S_FADDR_DUAL_S  5
/** SPI1_MEM_S_FDIN_QUAD : R/W; bitpos: [6]; default: 0;
 *  For SPI1, din phase apply 4 signals. 1: enable 0: disable.  The bit is the same
 *  with SPI1_MEM_S_fread_qio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI1_MEM_S_FDIN_QUAD    (BIT(6))
#define SPI1_MEM_S_FDIN_QUAD_M  (SPI1_MEM_S_FDIN_QUAD_V << SPI1_MEM_S_FDIN_QUAD_S)
#define SPI1_MEM_S_FDIN_QUAD_V  0x00000001U
#define SPI1_MEM_S_FDIN_QUAD_S  6
/** SPI1_MEM_S_FDOUT_QUAD : R/W; bitpos: [7]; default: 0;
 *  For SPI1, dout phase apply 4 signals. 1: enable 0: disable.  The bit is the same
 *  with SPI1_MEM_S_fread_qio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI1_MEM_S_FDOUT_QUAD    (BIT(7))
#define SPI1_MEM_S_FDOUT_QUAD_M  (SPI1_MEM_S_FDOUT_QUAD_V << SPI1_MEM_S_FDOUT_QUAD_S)
#define SPI1_MEM_S_FDOUT_QUAD_V  0x00000001U
#define SPI1_MEM_S_FDOUT_QUAD_S  7
/** SPI1_MEM_S_FADDR_QUAD : R/W; bitpos: [8]; default: 0;
 *  For SPI1, address phase apply 4 signals. 1: enable 0: disable.  The bit is the same
 *  with SPI1_MEM_S_fread_qio.
 *  This field is only for internal debugging purposes. Do not use it in applications.
 */
#define SPI1_MEM_S_FADDR_QUAD    (BIT(8))
#define SPI1_MEM_S_FADDR_QUAD_M  (SPI1_MEM_S_FADDR_QUAD_V << SPI1_MEM_S_FADDR_QUAD_S)
#define SPI1_MEM_S_FADDR_QUAD_V  0x00000001U
#define SPI1_MEM_S_FADDR_QUAD_S  8

/** SPI1_MEM_S_W0_REG register
 *  SPI1 memory data buffer0
 */
#define SPI1_MEM_S_W0_REG (DR_REG_PSRAM_MSPI1_BASE + 0x58)
/** SPI1_MEM_S_BUF0 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define SPI1_MEM_S_BUF0    0xFFFFFFFFU
#define SPI1_MEM_S_BUF0_M  (SPI1_MEM_S_BUF0_V << SPI1_MEM_S_BUF0_S)
#define SPI1_MEM_S_BUF0_V  0xFFFFFFFFU
#define SPI1_MEM_S_BUF0_S  0

/** SPI1_MEM_S_W1_REG register
 *  SPI1 memory data buffer1
 */
#define SPI1_MEM_S_W1_REG (DR_REG_PSRAM_MSPI1_BASE + 0x5c)
/** SPI1_MEM_S_BUF1 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define SPI1_MEM_S_BUF1    0xFFFFFFFFU
#define SPI1_MEM_S_BUF1_M  (SPI1_MEM_S_BUF1_V << SPI1_MEM_S_BUF1_S)
#define SPI1_MEM_S_BUF1_V  0xFFFFFFFFU
#define SPI1_MEM_S_BUF1_S  0

