espressif/esp-idf/components/soc/esp32s31/register/soc/spi1_mem_s_reg.h
/** SPI1_MEM_S_W2_REG register
 *  SPI1 memory data buffer2
 */
#define SPI1_MEM_S_W2_REG (DR_REG_PSRAM_MSPI1_BASE + 0x60)
/** SPI1_MEM_S_BUF2 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define SPI1_MEM_S_BUF2    0xFFFFFFFFU
#define SPI1_MEM_S_BUF2_M  (SPI1_MEM_S_BUF2_V << SPI1_MEM_S_BUF2_S)
#define SPI1_MEM_S_BUF2_V  0xFFFFFFFFU
#define SPI1_MEM_S_BUF2_S  0

/** SPI1_MEM_S_W3_REG register
 *  SPI1 memory data buffer3
 */
#define SPI1_MEM_S_W3_REG (DR_REG_PSRAM_MSPI1_BASE + 0x64)
/** SPI1_MEM_S_BUF3 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define SPI1_MEM_S_BUF3    0xFFFFFFFFU
#define SPI1_MEM_S_BUF3_M  (SPI1_MEM_S_BUF3_V << SPI1_MEM_S_BUF3_S)
#define SPI1_MEM_S_BUF3_V  0xFFFFFFFFU
#define SPI1_MEM_S_BUF3_S  0

/** SPI1_MEM_S_W4_REG register
 *  SPI1 memory data buffer4
 */
#define SPI1_MEM_S_W4_REG (DR_REG_PSRAM_MSPI1_BASE + 0x68)
/** SPI1_MEM_S_BUF4 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define SPI1_MEM_S_BUF4    0xFFFFFFFFU
#define SPI1_MEM_S_BUF4_M  (SPI1_MEM_S_BUF4_V << SPI1_MEM_S_BUF4_S)
#define SPI1_MEM_S_BUF4_V  0xFFFFFFFFU
#define SPI1_MEM_S_BUF4_S  0

/** SPI1_MEM_S_W5_REG register
 *  SPI1 memory data buffer5
 */
#define SPI1_MEM_S_W5_REG (DR_REG_PSRAM_MSPI1_BASE + 0x6c)
/** SPI1_MEM_S_BUF5 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define SPI1_MEM_S_BUF5    0xFFFFFFFFU
#define SPI1_MEM_S_BUF5_M  (SPI1_MEM_S_BUF5_V << SPI1_MEM_S_BUF5_S)
#define SPI1_MEM_S_BUF5_V  0xFFFFFFFFU
#define SPI1_MEM_S_BUF5_S  0

/** SPI1_MEM_S_W6_REG register
 *  SPI1 memory data buffer6
 */
#define SPI1_MEM_S_W6_REG (DR_REG_PSRAM_MSPI1_BASE + 0x70)
/** SPI1_MEM_S_BUF6 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define SPI1_MEM_S_BUF6    0xFFFFFFFFU
#define SPI1_MEM_S_BUF6_M  (SPI1_MEM_S_BUF6_V << SPI1_MEM_S_BUF6_S)
#define SPI1_MEM_S_BUF6_V  0xFFFFFFFFU
#define SPI1_MEM_S_BUF6_S  0

/** SPI1_MEM_S_W7_REG register
 *  SPI1 memory data buffer7
 */
#define SPI1_MEM_S_W7_REG (DR_REG_PSRAM_MSPI1_BASE + 0x74)
/** SPI1_MEM_S_BUF7 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define SPI1_MEM_S_BUF7    0xFFFFFFFFU
#define SPI1_MEM_S_BUF7_M  (SPI1_MEM_S_BUF7_V << SPI1_MEM_S_BUF7_S)
#define SPI1_MEM_S_BUF7_V  0xFFFFFFFFU
#define SPI1_MEM_S_BUF7_S  0

/** SPI1_MEM_S_W8_REG register
 *  SPI1 memory data buffer8
 */
#define SPI1_MEM_S_W8_REG (DR_REG_PSRAM_MSPI1_BASE + 0x78)
/** SPI1_MEM_S_BUF8 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define SPI1_MEM_S_BUF8    0xFFFFFFFFU
#define SPI1_MEM_S_BUF8_M  (SPI1_MEM_S_BUF8_V << SPI1_MEM_S_BUF8_S)
#define SPI1_MEM_S_BUF8_V  0xFFFFFFFFU
#define SPI1_MEM_S_BUF8_S  0

/** SPI1_MEM_S_W9_REG register
 *  SPI1 memory data buffer9
 */
#define SPI1_MEM_S_W9_REG (DR_REG_PSRAM_MSPI1_BASE + 0x7c)
/** SPI1_MEM_S_BUF9 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define SPI1_MEM_S_BUF9    0xFFFFFFFFU
#define SPI1_MEM_S_BUF9_M  (SPI1_MEM_S_BUF9_V << SPI1_MEM_S_BUF9_S)
#define SPI1_MEM_S_BUF9_V  0xFFFFFFFFU
#define SPI1_MEM_S_BUF9_S  0

/** SPI1_MEM_S_W10_REG register
 *  SPI1 memory data buffer10
 */
#define SPI1_MEM_S_W10_REG (DR_REG_PSRAM_MSPI1_BASE + 0x80)
/** SPI1_MEM_S_BUF10 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define SPI1_MEM_S_BUF10    0xFFFFFFFFU
#define SPI1_MEM_S_BUF10_M  (SPI1_MEM_S_BUF10_V << SPI1_MEM_S_BUF10_S)
#define SPI1_MEM_S_BUF10_V  0xFFFFFFFFU
#define SPI1_MEM_S_BUF10_S  0

/** SPI1_MEM_S_W11_REG register
 *  SPI1 memory data buffer11
 */
#define SPI1_MEM_S_W11_REG (DR_REG_PSRAM_MSPI1_BASE + 0x84)
/** SPI1_MEM_S_BUF11 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define SPI1_MEM_S_BUF11    0xFFFFFFFFU
#define SPI1_MEM_S_BUF11_M  (SPI1_MEM_S_BUF11_V << SPI1_MEM_S_BUF11_S)
#define SPI1_MEM_S_BUF11_V  0xFFFFFFFFU
#define SPI1_MEM_S_BUF11_S  0

/** SPI1_MEM_S_W12_REG register
 *  SPI1 memory data buffer12
 */
#define SPI1_MEM_S_W12_REG (DR_REG_PSRAM_MSPI1_BASE + 0x88)
/** SPI1_MEM_S_BUF12 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define SPI1_MEM_S_BUF12    0xFFFFFFFFU
#define SPI1_MEM_S_BUF12_M  (SPI1_MEM_S_BUF12_V << SPI1_MEM_S_BUF12_S)
#define SPI1_MEM_S_BUF12_V  0xFFFFFFFFU
#define SPI1_MEM_S_BUF12_S  0

/** SPI1_MEM_S_W13_REG register
 *  SPI1 memory data buffer13
 */
#define SPI1_MEM_S_W13_REG (DR_REG_PSRAM_MSPI1_BASE + 0x8c)
/** SPI1_MEM_S_BUF13 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define SPI1_MEM_S_BUF13    0xFFFFFFFFU
#define SPI1_MEM_S_BUF13_M  (SPI1_MEM_S_BUF13_V << SPI1_MEM_S_BUF13_S)
#define SPI1_MEM_S_BUF13_V  0xFFFFFFFFU
#define SPI1_MEM_S_BUF13_S  0

/** SPI1_MEM_S_W14_REG register
 *  SPI1 memory data buffer14
 */
#define SPI1_MEM_S_W14_REG (DR_REG_PSRAM_MSPI1_BASE + 0x90)
/** SPI1_MEM_S_BUF14 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define SPI1_MEM_S_BUF14    0xFFFFFFFFU
#define SPI1_MEM_S_BUF14_M  (SPI1_MEM_S_BUF14_V << SPI1_MEM_S_BUF14_S)
#define SPI1_MEM_S_BUF14_V  0xFFFFFFFFU
#define SPI1_MEM_S_BUF14_S  0

/** SPI1_MEM_S_W15_REG register
 *  SPI1 memory data buffer15
 */
#define SPI1_MEM_S_W15_REG (DR_REG_PSRAM_MSPI1_BASE + 0x94)
/** SPI1_MEM_S_BUF15 : R/W/SS; bitpos: [31:0]; default: 0;
 *  data buffer
 */
#define SPI1_MEM_S_BUF15    0xFFFFFFFFU
#define SPI1_MEM_S_BUF15_M  (SPI1_MEM_S_BUF15_V << SPI1_MEM_S_BUF15_S)
#define SPI1_MEM_S_BUF15_V  0xFFFFFFFFU
#define SPI1_MEM_S_BUF15_S  0

/** SPI1_MEM_S_FLASH_WAITI_CTRL_REG register
 *  SPI1 wait idle control register
 */
#define SPI1_MEM_S_FLASH_WAITI_CTRL_REG (DR_REG_PSRAM_MSPI1_BASE + 0x98)
/** SPI1_MEM_S_WAITI_EN : R/W; bitpos: [0]; default: 1;
 *  1: The hardware will wait idle after SE/PP/WRSR automatically, and hardware auto
 *  Suspend/Resume can be enabled. 0: The functions of hardware wait idle and auto
 *  Suspend/Resume are not supported.
 */
#define SPI1_MEM_S_WAITI_EN    (BIT(0))
#define SPI1_MEM_S_WAITI_EN_M  (SPI1_MEM_S_WAITI_EN_V << SPI1_MEM_S_WAITI_EN_S)
#define SPI1_MEM_S_WAITI_EN_V  0x00000001U
#define SPI1_MEM_S_WAITI_EN_S  0
/** SPI1_MEM_S_WAITI_DUMMY : R/W; bitpos: [1]; default: 0;
 *  The dummy phase enable when wait flash idle (RDSR)
 */
#define SPI1_MEM_S_WAITI_DUMMY    (BIT(1))
#define SPI1_MEM_S_WAITI_DUMMY_M  (SPI1_MEM_S_WAITI_DUMMY_V << SPI1_MEM_S_WAITI_DUMMY_S)
#define SPI1_MEM_S_WAITI_DUMMY_V  0x00000001U
#define SPI1_MEM_S_WAITI_DUMMY_S  1
/** SPI1_MEM_S_WAITI_ADDR_EN : R/W; bitpos: [2]; default: 0;
 *  1: Output  address 0 in RDSR or read SUS command transfer. 0: Do not send out
 *  address in RDSR or read SUS command transfer.
 */
#define SPI1_MEM_S_WAITI_ADDR_EN    (BIT(2))
#define SPI1_MEM_S_WAITI_ADDR_EN_M  (SPI1_MEM_S_WAITI_ADDR_EN_V << SPI1_MEM_S_WAITI_ADDR_EN_S)
#define SPI1_MEM_S_WAITI_ADDR_EN_V  0x00000001U
#define SPI1_MEM_S_WAITI_ADDR_EN_S  2
/** SPI1_MEM_S_WAITI_ADDR_CYCLELEN : R/W; bitpos: [4:3]; default: 0;
 *  When SPI1_MEM_S_WAITI_ADDR_EN is set, the  cycle length of sent out address is
 *  (SPI1_MEM_S_WAITI_ADDR_CYCLELEN[1:0] + 1) SPI  bus clock cycles. It is not active when
 *  SPI1_MEM_S_WAITI_ADDR_EN is cleared.
 */
#define SPI1_MEM_S_WAITI_ADDR_CYCLELEN    0x00000003U
#define SPI1_MEM_S_WAITI_ADDR_CYCLELEN_M  (SPI1_MEM_S_WAITI_ADDR_CYCLELEN_V << SPI1_MEM_S_WAITI_ADDR_CYCLELEN_S)
#define SPI1_MEM_S_WAITI_ADDR_CYCLELEN_V  0x00000003U
#define SPI1_MEM_S_WAITI_ADDR_CYCLELEN_S  3
/** SPI1_MEM_S_WAITI_CMD_2B : R/W; bitpos: [9]; default: 0;
 *  1:The wait idle command bit length is 16. 0: The wait idle command bit length is 8.
 */
#define SPI1_MEM_S_WAITI_CMD_2B    (BIT(9))
#define SPI1_MEM_S_WAITI_CMD_2B_M  (SPI1_MEM_S_WAITI_CMD_2B_V << SPI1_MEM_S_WAITI_CMD_2B_S)
#define SPI1_MEM_S_WAITI_CMD_2B_V  0x00000001U
#define SPI1_MEM_S_WAITI_CMD_2B_S  9
/** SPI1_MEM_S_WAITI_DUMMY_CYCLELEN : R/W; bitpos: [15:10]; default: 0;
 *  The dummy cycle length when wait flash idle(RDSR).
 */
#define SPI1_MEM_S_WAITI_DUMMY_CYCLELEN    0x0000003FU
#define SPI1_MEM_S_WAITI_DUMMY_CYCLELEN_M  (SPI1_MEM_S_WAITI_DUMMY_CYCLELEN_V << SPI1_MEM_S_WAITI_DUMMY_CYCLELEN_S)
#define SPI1_MEM_S_WAITI_DUMMY_CYCLELEN_V  0x0000003FU
#define SPI1_MEM_S_WAITI_DUMMY_CYCLELEN_S  10
/** SPI1_MEM_S_WAITI_CMD : R/W; bitpos: [31:16]; default: 5;
 *  The command value to wait flash idle(RDSR).
 */
#define SPI1_MEM_S_WAITI_CMD    0x0000FFFFU
#define SPI1_MEM_S_WAITI_CMD_M  (SPI1_MEM_S_WAITI_CMD_V << SPI1_MEM_S_WAITI_CMD_S)
#define SPI1_MEM_S_WAITI_CMD_V  0x0000FFFFU
#define SPI1_MEM_S_WAITI_CMD_S  16

/** SPI1_MEM_S_FLASH_SUS_CTRL_REG register
 *  SPI1 flash suspend control register
 */
#define SPI1_MEM_S_FLASH_SUS_CTRL_REG (DR_REG_PSRAM_MSPI1_BASE + 0x9c)
/** SPI1_MEM_S_FLASH_PER : R/W/SC; bitpos: [0]; default: 0;
 *  program erase resume bit, program erase suspend operation will be triggered when
 *  the bit is set. The bit will be cleared once the operation done.1: enable 0:
 *  disable.
 */
#define SPI1_MEM_S_FLASH_PER    (BIT(0))
#define SPI1_MEM_S_FLASH_PER_M  (SPI1_MEM_S_FLASH_PER_V << SPI1_MEM_S_FLASH_PER_S)
#define SPI1_MEM_S_FLASH_PER_V  0x00000001U
#define SPI1_MEM_S_FLASH_PER_S  0
/** SPI1_MEM_S_FLASH_PES : R/W/SC; bitpos: [1]; default: 0;
 *  program erase suspend bit, program erase suspend operation will be triggered when
 *  the bit is set. The bit will be cleared once the operation done.1: enable 0:
 *  disable.
 */
#define SPI1_MEM_S_FLASH_PES    (BIT(1))
#define SPI1_MEM_S_FLASH_PES_M  (SPI1_MEM_S_FLASH_PES_V << SPI1_MEM_S_FLASH_PES_S)
#define SPI1_MEM_S_FLASH_PES_V  0x00000001U
#define SPI1_MEM_S_FLASH_PES_S  1
/** SPI1_MEM_S_FLASH_PER_WAIT_EN : R/W; bitpos: [2]; default: 0;
 *  1: SPI1 waits (SPI1_MEM_S_CS_HOLD_DELAY_RES[9:0] * 4 or *128) SPI_CLK cycles after
 *  program erase resume command is sent. 0: SPI1 does not wait after program erase
 *  resume command is sent.
 */
#define SPI1_MEM_S_FLASH_PER_WAIT_EN    (BIT(2))
#define SPI1_MEM_S_FLASH_PER_WAIT_EN_M  (SPI1_MEM_S_FLASH_PER_WAIT_EN_V << SPI1_MEM_S_FLASH_PER_WAIT_EN_S)
#define SPI1_MEM_S_FLASH_PER_WAIT_EN_V  0x00000001U
#define SPI1_MEM_S_FLASH_PER_WAIT_EN_S  2
/** SPI1_MEM_S_FLASH_PES_WAIT_EN : R/W; bitpos: [3]; default: 0;
 *  1: SPI1 waits (SPI1_MEM_S_CS_HOLD_DELAY_RES[9:0] * 4 or *128) SPI_CLK cycles after
 *  program erase suspend command is sent. 0: SPI1 does not wait after program erase
 *  suspend command is sent.
 */
#define SPI1_MEM_S_FLASH_PES_WAIT_EN    (BIT(3))
#define SPI1_MEM_S_FLASH_PES_WAIT_EN_M  (SPI1_MEM_S_FLASH_PES_WAIT_EN_V << SPI1_MEM_S_FLASH_PES_WAIT_EN_S)
#define SPI1_MEM_S_FLASH_PES_WAIT_EN_V  0x00000001U
#define SPI1_MEM_S_FLASH_PES_WAIT_EN_S  3
/** SPI1_MEM_S_PES_PER_EN : R/W; bitpos: [4]; default: 0;
 *  Set this bit to enable PES end triggers PER transfer option. If this bit is 0,
 *  application should send PER after PES is done.
 */
#define SPI1_MEM_S_PES_PER_EN    (BIT(4))
#define SPI1_MEM_S_PES_PER_EN_M  (SPI1_MEM_S_PES_PER_EN_V << SPI1_MEM_S_PES_PER_EN_S)
#define SPI1_MEM_S_PES_PER_EN_V  0x00000001U
#define SPI1_MEM_S_PES_PER_EN_S  4
/** SPI1_MEM_S_FLASH_PES_EN : R/W; bitpos: [5]; default: 0;
 *  Set this bit to enable Auto-suspending function.
 */
#define SPI1_MEM_S_FLASH_PES_EN    (BIT(5))
#define SPI1_MEM_S_FLASH_PES_EN_M  (SPI1_MEM_S_FLASH_PES_EN_V << SPI1_MEM_S_FLASH_PES_EN_S)
#define SPI1_MEM_S_FLASH_PES_EN_V  0x00000001U
#define SPI1_MEM_S_FLASH_PES_EN_S  5
/** SPI1_MEM_S_PESR_END_MSK : R/W; bitpos: [21:6]; default: 128;
 *  The mask value when check SUS/SUS1/SUS2 status bit. If the read status value is
 *  status_in[15:0](only status_in[7:0] is valid when only one byte of data is read
 *  out, status_in[15:0] is valid when two bytes of data are read out), SUS/SUS1/SUS2 =
 *  status_in[15:0]^ SPI1_MEM_S_PESR_END_MSK[15:0].
 */
#define SPI1_MEM_S_PESR_END_MSK    0x0000FFFFU
#define SPI1_MEM_S_PESR_END_MSK_M  (SPI1_MEM_S_PESR_END_MSK_V << SPI1_MEM_S_PESR_END_MSK_S)
#define SPI1_MEM_S_PESR_END_MSK_V  0x0000FFFFU
#define SPI1_MEM_S_PESR_END_MSK_S  6
/** SPI1_MEM_S_FMEM_RD_SUS_2B : R/W; bitpos: [22]; default: 0;
 *  1: Read two bytes when check flash SUS/SUS1/SUS2 status bit. 0:  Read one byte when
 *  check flash SUS/SUS1/SUS2 status bit
 */
#define SPI1_MEM_S_FMEM_RD_SUS_2B    (BIT(22))
#define SPI1_MEM_S_FMEM_RD_SUS_2B_M  (SPI1_MEM_S_FMEM_RD_SUS_2B_V << SPI1_MEM_S_FMEM_RD_SUS_2B_S)
#define SPI1_MEM_S_FMEM_RD_SUS_2B_V  0x00000001U
#define SPI1_MEM_S_FMEM_RD_SUS_2B_S  22
/** SPI1_MEM_S_PER_END_EN : R/W; bitpos: [23]; default: 0;
 *  1: Both WIP and SUS/SUS1/SUS2 bits should be checked to insure the resume status of
 *  flash. 0: Only need to check WIP is 0.
 */
#define SPI1_MEM_S_PER_END_EN    (BIT(23))
#define SPI1_MEM_S_PER_END_EN_M  (SPI1_MEM_S_PER_END_EN_V << SPI1_MEM_S_PER_END_EN_S)
#define SPI1_MEM_S_PER_END_EN_V  0x00000001U
#define SPI1_MEM_S_PER_END_EN_S  23
/** SPI1_MEM_S_PES_END_EN : R/W; bitpos: [24]; default: 0;
 *  1: Both WIP and SUS/SUS1/SUS2 bits should be checked to insure the suspend status
 *  of flash. 0: Only need to check WIP is 0.
 */
#define SPI1_MEM_S_PES_END_EN    (BIT(24))
#define SPI1_MEM_S_PES_END_EN_M  (SPI1_MEM_S_PES_END_EN_V << SPI1_MEM_S_PES_END_EN_S)
#define SPI1_MEM_S_PES_END_EN_V  0x00000001U
#define SPI1_MEM_S_PES_END_EN_S  24
/** SPI1_MEM_S_SUS_TIMEOUT_CNT : R/W; bitpos: [31:25]; default: 4;
 *  When SPI1 checks SUS/SUS1/SUS2 bits fail for SPI1_MEM_S_SUS_TIMEOUT_CNT[6:0] times, it
 *  will be treated as check pass.
 */
#define SPI1_MEM_S_SUS_TIMEOUT_CNT    0x0000007FU
#define SPI1_MEM_S_SUS_TIMEOUT_CNT_M  (SPI1_MEM_S_SUS_TIMEOUT_CNT_V << SPI1_MEM_S_SUS_TIMEOUT_CNT_S)
#define SPI1_MEM_S_SUS_TIMEOUT_CNT_V  0x0000007FU
#define SPI1_MEM_S_SUS_TIMEOUT_CNT_S  25

