espressif/esp-idf/components/soc/esp32s31/register/soc/spi1_mem_s_reg.h
/** SPI1_MEM_S_INT_CLR_REG register
 *  SPI1 interrupt clear register
 */
#define SPI1_MEM_S_INT_CLR_REG (DR_REG_PSRAM_MSPI1_BASE + 0xc4)
/** SPI1_MEM_S_PER_END_INT_CLR : WT; bitpos: [0]; default: 0;
 *  The clear bit for SPI1_MEM_S_PER_END_INT interrupt.
 */
#define SPI1_MEM_S_PER_END_INT_CLR    (BIT(0))
#define SPI1_MEM_S_PER_END_INT_CLR_M  (SPI1_MEM_S_PER_END_INT_CLR_V << SPI1_MEM_S_PER_END_INT_CLR_S)
#define SPI1_MEM_S_PER_END_INT_CLR_V  0x00000001U
#define SPI1_MEM_S_PER_END_INT_CLR_S  0
/** SPI1_MEM_S_PES_END_INT_CLR : WT; bitpos: [1]; default: 0;
 *  The clear bit for SPI1_MEM_S_PES_END_INT interrupt.
 */
#define SPI1_MEM_S_PES_END_INT_CLR    (BIT(1))
#define SPI1_MEM_S_PES_END_INT_CLR_M  (SPI1_MEM_S_PES_END_INT_CLR_V << SPI1_MEM_S_PES_END_INT_CLR_S)
#define SPI1_MEM_S_PES_END_INT_CLR_V  0x00000001U
#define SPI1_MEM_S_PES_END_INT_CLR_S  1
/** SPI1_MEM_S_WPE_END_INT_CLR : WT; bitpos: [2]; default: 0;
 *  The clear bit for SPI1_MEM_S_WPE_END_INT interrupt.
 */
#define SPI1_MEM_S_WPE_END_INT_CLR    (BIT(2))
#define SPI1_MEM_S_WPE_END_INT_CLR_M  (SPI1_MEM_S_WPE_END_INT_CLR_V << SPI1_MEM_S_WPE_END_INT_CLR_S)
#define SPI1_MEM_S_WPE_END_INT_CLR_V  0x00000001U
#define SPI1_MEM_S_WPE_END_INT_CLR_S  2
/** SPI1_MEM_S_SLV_ST_END_INT_CLR : WT; bitpos: [3]; default: 0;
 *  The clear bit for SPI1_MEM_S_SLV_ST_END_INT interrupt.
 */
#define SPI1_MEM_S_SLV_ST_END_INT_CLR    (BIT(3))
#define SPI1_MEM_S_SLV_ST_END_INT_CLR_M  (SPI1_MEM_S_SLV_ST_END_INT_CLR_V << SPI1_MEM_S_SLV_ST_END_INT_CLR_S)
#define SPI1_MEM_S_SLV_ST_END_INT_CLR_V  0x00000001U
#define SPI1_MEM_S_SLV_ST_END_INT_CLR_S  3
/** SPI1_MEM_S_MST_ST_END_INT_CLR : WT; bitpos: [4]; default: 0;
 *  The clear bit for SPI1_MEM_S_MST_ST_END_INT interrupt.
 */
#define SPI1_MEM_S_MST_ST_END_INT_CLR    (BIT(4))
#define SPI1_MEM_S_MST_ST_END_INT_CLR_M  (SPI1_MEM_S_MST_ST_END_INT_CLR_V << SPI1_MEM_S_MST_ST_END_INT_CLR_S)
#define SPI1_MEM_S_MST_ST_END_INT_CLR_V  0x00000001U
#define SPI1_MEM_S_MST_ST_END_INT_CLR_S  4
/** SPI1_MEM_S_BROWN_OUT_INT_CLR : WT; bitpos: [10]; default: 0;
 *  The status bit for SPI1_MEM_S_BROWN_OUT_INT interrupt.
 */
#define SPI1_MEM_S_BROWN_OUT_INT_CLR    (BIT(10))
#define SPI1_MEM_S_BROWN_OUT_INT_CLR_M  (SPI1_MEM_S_BROWN_OUT_INT_CLR_V << SPI1_MEM_S_BROWN_OUT_INT_CLR_S)
#define SPI1_MEM_S_BROWN_OUT_INT_CLR_V  0x00000001U
#define SPI1_MEM_S_BROWN_OUT_INT_CLR_S  10

/** SPI1_MEM_S_INT_RAW_REG register
 *  SPI1 interrupt raw register
 */
#define SPI1_MEM_S_INT_RAW_REG (DR_REG_PSRAM_MSPI1_BASE + 0xc8)
/** SPI1_MEM_S_PER_END_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw bit for SPI1_MEM_S_PER_END_INT interrupt. 1: Triggered when Auto Resume
 *  command (0x7A) is sent and flash is resumed successfully. 0: Others.
 */
#define SPI1_MEM_S_PER_END_INT_RAW    (BIT(0))
#define SPI1_MEM_S_PER_END_INT_RAW_M  (SPI1_MEM_S_PER_END_INT_RAW_V << SPI1_MEM_S_PER_END_INT_RAW_S)
#define SPI1_MEM_S_PER_END_INT_RAW_V  0x00000001U
#define SPI1_MEM_S_PER_END_INT_RAW_S  0
/** SPI1_MEM_S_PES_END_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw bit for SPI1_MEM_S_PES_END_INT interrupt.1: Triggered when Auto Suspend
 *  command (0x75) is sent and flash is suspended successfully. 0: Others.
 */
#define SPI1_MEM_S_PES_END_INT_RAW    (BIT(1))
#define SPI1_MEM_S_PES_END_INT_RAW_M  (SPI1_MEM_S_PES_END_INT_RAW_V << SPI1_MEM_S_PES_END_INT_RAW_S)
#define SPI1_MEM_S_PES_END_INT_RAW_V  0x00000001U
#define SPI1_MEM_S_PES_END_INT_RAW_S  1
/** SPI1_MEM_S_WPE_END_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw bit for SPI1_MEM_S_WPE_END_INT interrupt. 1: Triggered when WRSR/PP/SE/BE/CE
 *  is sent and flash is already idle. 0: Others.
 */
#define SPI1_MEM_S_WPE_END_INT_RAW    (BIT(2))
#define SPI1_MEM_S_WPE_END_INT_RAW_M  (SPI1_MEM_S_WPE_END_INT_RAW_V << SPI1_MEM_S_WPE_END_INT_RAW_S)
#define SPI1_MEM_S_WPE_END_INT_RAW_V  0x00000001U
#define SPI1_MEM_S_WPE_END_INT_RAW_S  2
/** SPI1_MEM_S_SLV_ST_END_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw bit for SPI1_MEM_S_SLV_ST_END_INT interrupt. 1: Triggered when spi1_slv_st is
 *  changed from non idle state to idle state. It means that SPI_CS raises high. 0:
 *  Others
 */
#define SPI1_MEM_S_SLV_ST_END_INT_RAW    (BIT(3))
#define SPI1_MEM_S_SLV_ST_END_INT_RAW_M  (SPI1_MEM_S_SLV_ST_END_INT_RAW_V << SPI1_MEM_S_SLV_ST_END_INT_RAW_S)
#define SPI1_MEM_S_SLV_ST_END_INT_RAW_V  0x00000001U
#define SPI1_MEM_S_SLV_ST_END_INT_RAW_S  3
/** SPI1_MEM_S_MST_ST_END_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw bit for SPI1_MEM_S_MST_ST_END_INT interrupt. 1: Triggered when spi1_mst_st is
 *  changed from non idle state to idle state. 0: Others.
 */
#define SPI1_MEM_S_MST_ST_END_INT_RAW    (BIT(4))
#define SPI1_MEM_S_MST_ST_END_INT_RAW_M  (SPI1_MEM_S_MST_ST_END_INT_RAW_V << SPI1_MEM_S_MST_ST_END_INT_RAW_S)
#define SPI1_MEM_S_MST_ST_END_INT_RAW_V  0x00000001U
#define SPI1_MEM_S_MST_ST_END_INT_RAW_S  4
/** SPI1_MEM_S_BROWN_OUT_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  The raw bit for SPI1_MEM_S_BROWN_OUT_INT interrupt. 1: Triggered condition is that
 *  chip is losing power and RTC module sends out brown out close flash request to
 *  SPI1. After SPI1 sends out suspend command to flash, this interrupt is triggered
 *  and MSPI returns to idle state. 0: Others.
 */
#define SPI1_MEM_S_BROWN_OUT_INT_RAW    (BIT(10))
#define SPI1_MEM_S_BROWN_OUT_INT_RAW_M  (SPI1_MEM_S_BROWN_OUT_INT_RAW_V << SPI1_MEM_S_BROWN_OUT_INT_RAW_S)
#define SPI1_MEM_S_BROWN_OUT_INT_RAW_V  0x00000001U
#define SPI1_MEM_S_BROWN_OUT_INT_RAW_S  10

/** SPI1_MEM_S_INT_ST_REG register
 *  SPI1 interrupt status register
 */
#define SPI1_MEM_S_INT_ST_REG (DR_REG_PSRAM_MSPI1_BASE + 0xcc)
/** SPI1_MEM_S_PER_END_INT_ST : RO; bitpos: [0]; default: 0;
 *  The status bit for SPI1_MEM_S_PER_END_INT interrupt.
 */
#define SPI1_MEM_S_PER_END_INT_ST    (BIT(0))
#define SPI1_MEM_S_PER_END_INT_ST_M  (SPI1_MEM_S_PER_END_INT_ST_V << SPI1_MEM_S_PER_END_INT_ST_S)
#define SPI1_MEM_S_PER_END_INT_ST_V  0x00000001U
#define SPI1_MEM_S_PER_END_INT_ST_S  0
/** SPI1_MEM_S_PES_END_INT_ST : RO; bitpos: [1]; default: 0;
 *  The status bit for SPI1_MEM_S_PES_END_INT interrupt.
 */
#define SPI1_MEM_S_PES_END_INT_ST    (BIT(1))
#define SPI1_MEM_S_PES_END_INT_ST_M  (SPI1_MEM_S_PES_END_INT_ST_V << SPI1_MEM_S_PES_END_INT_ST_S)
#define SPI1_MEM_S_PES_END_INT_ST_V  0x00000001U
#define SPI1_MEM_S_PES_END_INT_ST_S  1
/** SPI1_MEM_S_WPE_END_INT_ST : RO; bitpos: [2]; default: 0;
 *  The status bit for SPI1_MEM_S_WPE_END_INT interrupt.
 */
#define SPI1_MEM_S_WPE_END_INT_ST    (BIT(2))
#define SPI1_MEM_S_WPE_END_INT_ST_M  (SPI1_MEM_S_WPE_END_INT_ST_V << SPI1_MEM_S_WPE_END_INT_ST_S)
#define SPI1_MEM_S_WPE_END_INT_ST_V  0x00000001U
#define SPI1_MEM_S_WPE_END_INT_ST_S  2
/** SPI1_MEM_S_SLV_ST_END_INT_ST : RO; bitpos: [3]; default: 0;
 *  The status bit for SPI1_MEM_S_SLV_ST_END_INT interrupt.
 */
#define SPI1_MEM_S_SLV_ST_END_INT_ST    (BIT(3))
#define SPI1_MEM_S_SLV_ST_END_INT_ST_M  (SPI1_MEM_S_SLV_ST_END_INT_ST_V << SPI1_MEM_S_SLV_ST_END_INT_ST_S)
#define SPI1_MEM_S_SLV_ST_END_INT_ST_V  0x00000001U
#define SPI1_MEM_S_SLV_ST_END_INT_ST_S  3
/** SPI1_MEM_S_MST_ST_END_INT_ST : RO; bitpos: [4]; default: 0;
 *  The status bit for SPI1_MEM_S_MST_ST_END_INT interrupt.
 */
#define SPI1_MEM_S_MST_ST_END_INT_ST    (BIT(4))
#define SPI1_MEM_S_MST_ST_END_INT_ST_M  (SPI1_MEM_S_MST_ST_END_INT_ST_V << SPI1_MEM_S_MST_ST_END_INT_ST_S)
#define SPI1_MEM_S_MST_ST_END_INT_ST_V  0x00000001U
#define SPI1_MEM_S_MST_ST_END_INT_ST_S  4
/** SPI1_MEM_S_BROWN_OUT_INT_ST : RO; bitpos: [10]; default: 0;
 *  The status bit for SPI1_MEM_S_BROWN_OUT_INT interrupt.
 */
#define SPI1_MEM_S_BROWN_OUT_INT_ST    (BIT(10))
#define SPI1_MEM_S_BROWN_OUT_INT_ST_M  (SPI1_MEM_S_BROWN_OUT_INT_ST_V << SPI1_MEM_S_BROWN_OUT_INT_ST_S)
#define SPI1_MEM_S_BROWN_OUT_INT_ST_V  0x00000001U
#define SPI1_MEM_S_BROWN_OUT_INT_ST_S  10

/** SPI1_MEM_S_DDR_REG register
 *  SPI1 DDR control register
 */
#define SPI1_MEM_S_DDR_REG (DR_REG_PSRAM_MSPI1_BASE + 0xd4)
/** SPI1_MEM_S_FMEM_DDR_EN : R/W; bitpos: [0]; default: 0;
 *  1: in ddr mode,  0 in sdr mode
 */
#define SPI1_MEM_S_FMEM_DDR_EN    (BIT(0))
#define SPI1_MEM_S_FMEM_DDR_EN_M  (SPI1_MEM_S_FMEM_DDR_EN_V << SPI1_MEM_S_FMEM_DDR_EN_S)
#define SPI1_MEM_S_FMEM_DDR_EN_V  0x00000001U
#define SPI1_MEM_S_FMEM_DDR_EN_S  0
/** SPI1_MEM_S_FMEM_VAR_DUMMY : R/W; bitpos: [1]; default: 0;
 *  Set the bit to enable variable dummy cycle in spi ddr mode.
 */
#define SPI1_MEM_S_FMEM_VAR_DUMMY    (BIT(1))
#define SPI1_MEM_S_FMEM_VAR_DUMMY_M  (SPI1_MEM_S_FMEM_VAR_DUMMY_V << SPI1_MEM_S_FMEM_VAR_DUMMY_S)
#define SPI1_MEM_S_FMEM_VAR_DUMMY_V  0x00000001U
#define SPI1_MEM_S_FMEM_VAR_DUMMY_S  1
/** SPI1_MEM_S_FMEM_DDR_RDAT_SWP : R/W; bitpos: [2]; default: 0;
 *  Set the bit to reorder rx data of the word in spi ddr mode.
 */
#define SPI1_MEM_S_FMEM_DDR_RDAT_SWP    (BIT(2))
#define SPI1_MEM_S_FMEM_DDR_RDAT_SWP_M  (SPI1_MEM_S_FMEM_DDR_RDAT_SWP_V << SPI1_MEM_S_FMEM_DDR_RDAT_SWP_S)
#define SPI1_MEM_S_FMEM_DDR_RDAT_SWP_V  0x00000001U
#define SPI1_MEM_S_FMEM_DDR_RDAT_SWP_S  2
/** SPI1_MEM_S_FMEM_DDR_WDAT_SWP : R/W; bitpos: [3]; default: 0;
 *  Set the bit to reorder tx data of the word in spi ddr mode.
 */
#define SPI1_MEM_S_FMEM_DDR_WDAT_SWP    (BIT(3))
#define SPI1_MEM_S_FMEM_DDR_WDAT_SWP_M  (SPI1_MEM_S_FMEM_DDR_WDAT_SWP_V << SPI1_MEM_S_FMEM_DDR_WDAT_SWP_S)
#define SPI1_MEM_S_FMEM_DDR_WDAT_SWP_V  0x00000001U
#define SPI1_MEM_S_FMEM_DDR_WDAT_SWP_S  3
/** SPI1_MEM_S_FMEM_DDR_CMD_DIS : R/W; bitpos: [4]; default: 0;
 *  the bit is used to disable dual edge in command phase when ddr mode.
 */
#define SPI1_MEM_S_FMEM_DDR_CMD_DIS    (BIT(4))
#define SPI1_MEM_S_FMEM_DDR_CMD_DIS_M  (SPI1_MEM_S_FMEM_DDR_CMD_DIS_V << SPI1_MEM_S_FMEM_DDR_CMD_DIS_S)
#define SPI1_MEM_S_FMEM_DDR_CMD_DIS_V  0x00000001U
#define SPI1_MEM_S_FMEM_DDR_CMD_DIS_S  4
/** SPI1_MEM_S_FMEM_OUTMINBYTELEN : R/W; bitpos: [11:5]; default: 1;
 *  It is the minimum output data length in the panda device.
 */
#define SPI1_MEM_S_FMEM_OUTMINBYTELEN    0x0000007FU
#define SPI1_MEM_S_FMEM_OUTMINBYTELEN_M  (SPI1_MEM_S_FMEM_OUTMINBYTELEN_V << SPI1_MEM_S_FMEM_OUTMINBYTELEN_S)
#define SPI1_MEM_S_FMEM_OUTMINBYTELEN_V  0x0000007FU
#define SPI1_MEM_S_FMEM_OUTMINBYTELEN_S  5
/** SPI1_MEM_S_FMEM_USR_DDR_DQS_THD : R/W; bitpos: [20:14]; default: 0;
 *  The delay number of data strobe which from memory based on SPI clock.
 */
#define SPI1_MEM_S_FMEM_USR_DDR_DQS_THD    0x0000007FU
#define SPI1_MEM_S_FMEM_USR_DDR_DQS_THD_M  (SPI1_MEM_S_FMEM_USR_DDR_DQS_THD_V << SPI1_MEM_S_FMEM_USR_DDR_DQS_THD_S)
#define SPI1_MEM_S_FMEM_USR_DDR_DQS_THD_V  0x0000007FU
#define SPI1_MEM_S_FMEM_USR_DDR_DQS_THD_S  14
/** SPI1_MEM_S_FMEM_DDR_DQS_LOOP : R/W; bitpos: [21]; default: 0;
 *  1: Do not need the input of SPI_DQS signal, SPI0 starts to receive data when
 *  spi0_slv_st is in SPI1_MEM_S_DIN state. It is used when there is no SPI_DQS signal or
 *  SPI_DQS signal is not stable. 0: SPI0 starts to store data at the positive and
 *  negative edge of SPI_DQS.
 */
#define SPI1_MEM_S_FMEM_DDR_DQS_LOOP    (BIT(21))
#define SPI1_MEM_S_FMEM_DDR_DQS_LOOP_M  (SPI1_MEM_S_FMEM_DDR_DQS_LOOP_V << SPI1_MEM_S_FMEM_DDR_DQS_LOOP_S)
#define SPI1_MEM_S_FMEM_DDR_DQS_LOOP_V  0x00000001U
#define SPI1_MEM_S_FMEM_DDR_DQS_LOOP_S  21
/** SPI1_MEM_S_FMEM_CLK_DIFF_EN : R/W; bitpos: [24]; default: 0;
 *  Set this bit to enable the differential SPI_CLK#.
 */
#define SPI1_MEM_S_FMEM_CLK_DIFF_EN    (BIT(24))
#define SPI1_MEM_S_FMEM_CLK_DIFF_EN_M  (SPI1_MEM_S_FMEM_CLK_DIFF_EN_V << SPI1_MEM_S_FMEM_CLK_DIFF_EN_S)
#define SPI1_MEM_S_FMEM_CLK_DIFF_EN_V  0x00000001U
#define SPI1_MEM_S_FMEM_CLK_DIFF_EN_S  24
/** SPI1_MEM_S_FMEM_DQS_CA_IN : R/W; bitpos: [26]; default: 0;
 *  Set this bit to enable the input of SPI_DQS signal in SPI phases of CMD and ADDR.
 */
#define SPI1_MEM_S_FMEM_DQS_CA_IN    (BIT(26))
#define SPI1_MEM_S_FMEM_DQS_CA_IN_M  (SPI1_MEM_S_FMEM_DQS_CA_IN_V << SPI1_MEM_S_FMEM_DQS_CA_IN_S)
#define SPI1_MEM_S_FMEM_DQS_CA_IN_V  0x00000001U
#define SPI1_MEM_S_FMEM_DQS_CA_IN_S  26
/** SPI1_MEM_S_FMEM_HYPERBUS_DUMMY_2X : R/W; bitpos: [27]; default: 0;
 *  Set this bit to enable the vary dummy function in SPI HyperBus mode, when SPI0
 *  accesses flash or SPI1 accesses flash or sram.
 */
#define SPI1_MEM_S_FMEM_HYPERBUS_DUMMY_2X    (BIT(27))
#define SPI1_MEM_S_FMEM_HYPERBUS_DUMMY_2X_M  (SPI1_MEM_S_FMEM_HYPERBUS_DUMMY_2X_V << SPI1_MEM_S_FMEM_HYPERBUS_DUMMY_2X_S)
#define SPI1_MEM_S_FMEM_HYPERBUS_DUMMY_2X_V  0x00000001U
#define SPI1_MEM_S_FMEM_HYPERBUS_DUMMY_2X_S  27
/** SPI1_MEM_S_FMEM_CLK_DIFF_INV : R/W; bitpos: [28]; default: 0;
 *  Set this bit to invert SPI_DIFF when accesses to flash. .
 */
#define SPI1_MEM_S_FMEM_CLK_DIFF_INV    (BIT(28))
#define SPI1_MEM_S_FMEM_CLK_DIFF_INV_M  (SPI1_MEM_S_FMEM_CLK_DIFF_INV_V << SPI1_MEM_S_FMEM_CLK_DIFF_INV_S)
#define SPI1_MEM_S_FMEM_CLK_DIFF_INV_V  0x00000001U
#define SPI1_MEM_S_FMEM_CLK_DIFF_INV_S  28
/** SPI1_MEM_S_FMEM_OCTA_RAM_ADDR : R/W; bitpos: [29]; default: 0;
 *  Set this bit to enable octa_ram address out when accesses to flash, which means
 *  ADDR_OUT[31:0] = {spi_usr_addr_value[25:4], 6'd0, spi_usr_addr_value[3:1], 1'b0}.
 */
#define SPI1_MEM_S_FMEM_OCTA_RAM_ADDR    (BIT(29))
#define SPI1_MEM_S_FMEM_OCTA_RAM_ADDR_M  (SPI1_MEM_S_FMEM_OCTA_RAM_ADDR_V << SPI1_MEM_S_FMEM_OCTA_RAM_ADDR_S)
#define SPI1_MEM_S_FMEM_OCTA_RAM_ADDR_V  0x00000001U
#define SPI1_MEM_S_FMEM_OCTA_RAM_ADDR_S  29
/** SPI1_MEM_S_FMEM_HYPERBUS_CA : R/W; bitpos: [30]; default: 0;
 *  Set this bit to enable HyperRAM address out when accesses to flash, which means
 *  ADDR_OUT[31:0] = {spi_usr_addr_value[19:4], 13'd0, spi_usr_addr_value[3:1]}.
 */
#define SPI1_MEM_S_FMEM_HYPERBUS_CA    (BIT(30))
#define SPI1_MEM_S_FMEM_HYPERBUS_CA_M  (SPI1_MEM_S_FMEM_HYPERBUS_CA_V << SPI1_MEM_S_FMEM_HYPERBUS_CA_S)
#define SPI1_MEM_S_FMEM_HYPERBUS_CA_V  0x00000001U
#define SPI1_MEM_S_FMEM_HYPERBUS_CA_S  30

